Tekla Open API Reference for Tekla Structures 2025
IResizeable Interface
 The IResizeable interface is implemented by objects that can be resized.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IResizeable
Public Interface IResizeable
The IResizeable type exposes the following members.
Methods
Name | Description
Resize
 Resizes the object to the specified size, overriding possible scaling settings.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.Size
Tekla.Structures.Drawing.IMovableRelative